app/Controllers/LoginController.php

    public function index()
    {
        $model = new User();
        $this->session->setFlashdata('old_input', $this->request->getPost());
        // $template = ['title' => 'Login'];
        if ($this->request->getMethod() == 'post') {


            // Validasi input
            $this->validation->setRules($model->validationAdd);

            if (!$this->validation->withRequest($this->request)->run()) {
                // Validasi gagal, tampilkan kembali form login dengan pesan error

                return view('/login/index', ['validation' => $this->validation]);
            } else {
                // Validasi sukses, lanjutkan dengan proses autentikasi
                // Lakukan pengecekan ke database atau sistem autentikasi lainnya
                // Jika autentikasi berhasil, redirect ke halaman berikutnya
                // Jika autentikasi gagal, tampilkan pesan error

                // Contoh autentikasi sederhana
                $username = $this->request->getPost('username');
                $password = $this->request->getPost('password');

                $user = $this->users->where(['username' => $username])->asObject()->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1